In [1]:
import pandas as pd
import numpy as np

In [2]:
train = pd.read_csv("_train.csv")
test = pd.read_csv("_test.csv")
event_type = pd.read_csv("event_type.csv")
log_feature = pd.read_csv("log_feature.csv")
resource_type = pd.read_csv("resource_type.csv")
severity_type = pd.read_csv("severity_type.csv")

In [10]:
train.head()
train.fault_severity.unique()
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5999 entries, 0 to 5998
Data columns (total 3 columns):
id                5999 non-null int64
location          5999 non-null object
fault_severity    5999 non-null int64
dtypes: int64(2), object(1)
memory usage: 140.7+ KB

In [11]:
test.head()
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1382 entries, 0 to 1381
Data columns (total 2 columns):
id          1382 non-null int64
location    1382 non-null object
dtypes: int64(1), object(1)
memory usage: 21.7+ KB

In [5]:
event_type.head()

     id     event_type
0  6597  event_type 11
1  8011  event_type 15
2  2597  event_type 15
3  5022  event_type 15
4  5022  event_type 11

In [6]:
log_feature.head()

     id  log_feature  volume
0  6597   feature 68       6
1  8011   feature 68       7
2  2597   feature 68       1
3  5022  feature 172       2
4  5022   feature 56       1

In [7]:
resource_type.head()

     id    resource_type
0  6597  resource_type 8
1  8011  resource_type 8
2  2597  resource_type 8
3  5022  resource_type 8
4  6852  resource_type 8

In [8]:
severity_type.head()

     id    severity_type
0  6597  severity_type 2
1  8011  severity_type 2
2  2597  severity_type 2
3  5022  severity_type 1
4  6852  severity_type 1

In [12]:
train_event = pd.merge(train,event_type,on='id')

In [17]:
train_event_log = pd.merge(train_event,log_feature,on='id')
train_event_log_res = pd.merge(train_event_log,resource_type,on='id')
train_event_log_res_severity = pd.merge(train_event_log_res,severity_type,on='id')

In [18]:
train_event_log_res_severity.head()

,id,location,fault_severity,event_type,log_feature,volume,resource_type,severity_type
0,14121,location 118,1,event_type 34,feature 312,19,resource_type 2,severity_type 2
1,14121,location 118,1,event_type 34,feature 232,19,resource_type 2,severity_type 2
2,14121,location 118,1,event_type 35,feature 312,19,resource_type 2,severity_type 2
3,14121,location 118,1,event_type 35,feature 232,19,resource_type 2,severity_type 2
4,9320,location 91,0,event_type 34,feature 315,200,resource_type 2,severity_type 2